#include "AK8975.h"
#include "USER_SPI.h"

/**************************实现函数********************************************
*功		能:	  使能/失能 AK8975
*输		入：
					ena	   ena为1时使能，为0时失能
*输		出：	无
*******************************************************************************/
static void ak8975_enable(uint8_t ena)
{
	if(ena)
		HAL_GPIO_WritePin(CS_AK_GPIO_Port,CS_AK_Pin,GPIO_PIN_RESET);
	else
		HAL_GPIO_WritePin(CS_AK_GPIO_Port,CS_AK_Pin,GPIO_PIN_SET);
}

/**************************实现函数********************************************
*功		能:	  触发 AK8975
*输		入：	无
*输		出：	无
*******************************************************************************/
static void ak8975_Trig(void)
{
	ak8975_enable(1);
	SPI1_RW(AK8975_CNTL_REG);
	SPI1_RW(0x01);
	ak8975_enable(0);
}

static uint8_t ak8975_buf[6];
/**************************实现函数********************************************
*功		能:	  读取 AK8975 原始数据
*输		入：	无
*输		出：	无
*******************************************************************************/
void Drv_AK8975_Read(void)
{	
	
	ak8975_enable(1);
	SPI1_RW(AK8975_HXL_REG|0x80);
	for(uint8_t i=0; i<6; i++)
		ak8975_buf[i] = SPI1_RW(0xff);
	ak8975_enable(0);
	
	ak8975_Trig();
	
}

/**************************实现函数********************************************
*功		能:	  转换AK8975原始数据
*输		入：	转换后的数据存放地址
*输		出：	无
*******************************************************************************/
void Mag_Get(int16_t mag_val[3])
{
	int16_t t[3];
	
	t[0] = ((((int16_t)ak8975_buf[1]) << 8) | ak8975_buf[0]) ;
	t[1] = ((((int16_t)ak8975_buf[3]) << 8) | ak8975_buf[2]) ;
	t[2] = ((((int16_t)ak8975_buf[5]) << 8) | ak8975_buf[4]) ;
	
	/*转换坐标轴为ANO坐标*/
	mag_val[0] = +t[0];
	mag_val[1] = -t[1];
	mag_val[2] = -t[2];
}

